{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')",
    "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-09-29T21:40:49.4795298Z",
    "creationSource": null,
    "description": "This policy enables BitLocker to fully encrypt fixed OS, data disks and removable disks based on AES 128-bit XTS. Keys will be stored in Azure AD and client-driven key rotation will be enabled.",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-09-29T21:45:08.9961669Z",
    "name": "NMM Force Bitlocker on Fixed and Removable Drives",
    "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 12,
    "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies": "mdm",
    "id": "1979764a-065d-4feb-949e-b3e32b58281a",
    "templateReference": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
        "templateId": "46ddfc50-d10f-4867-b852-9434254b3bff_1",
        "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
        "templateFamily": "endpointSecurityDiskEncryption",
        "templateDisplayName": "BitLocker",
        "templateDisplayVersion": "Version 1"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/assignments",
    "assignments": [],
    "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings",
    "settings": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('0')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('0')",
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('1')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('1')",
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_0",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('2')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('2')",
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "48c938a7-afa0-40ef-914f-40b5da5735b4"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_2",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "48278072-3b30-48e9-b654-ad683fdb9aae",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('3')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('3')",
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('4')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('4')",
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('5')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('5')",
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "b11b114c-0971-42bc-9eec-ebdd73cef0cb"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "e09c3a13-cf03-406c-8e8b-28a2f22939d1",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('6')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('6')",
            "id": "6",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('7')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('7')",
            "id": "7",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('8')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('8')",
            "id": "8",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_0",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('9')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('9')",
            "id": "9",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "7a47b4f2-0d06-46ea-a88a-9809830be5c8"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "ddfd6c77-f32f-480c-a43d-4970185ccf15",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('10')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('10')",
            "id": "10",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "5f8b6127-bc7f-469b-b903-ea3d46035448"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1",
                                "settingValueTemplateReference": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                    "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                                    "useTemplateDefault": false
                                },
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": [
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                                        "settingInstanceTemplateReference": null,
                                        "choiceSettingValue": {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                            "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                                            "settingValueTemplateReference": {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                                                "useTemplateDefault": false
                                            },
                                            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                            "children": [
                                                {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                    "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                                                    "settingInstanceTemplateReference": null,
                                                    "choiceSettingValue": {
                                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                        "settingValueTemplateReference": null,
                                                        "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_0",
                                                        "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                        "children": []
                                                    }
                                                }
                                            ]
                                        }
                                    }
                                ]
                            }
                        }
                    ]
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('11')",
            "@odata.editLink": "deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/settings('11')",
            "id": "11",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
                "settingInstanceTemplateReference": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                    "settingInstanceTemplateId": "28e5153b-24cb-45fd-b53d-96847b00c9a6"
                },
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
                    "settingValueTemplateReference": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                        "settingValueTemplateId": "06f0b5be-421d-4de1-92d1-b9c9b461fa38",
                        "useTemplateDefault": false
                    },
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
                            "settingInstanceTemplateReference": null,
                            "choiceSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0",
                                "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                "children": []
                            }
                        }
                    ]
                }
            }
        }
    ],
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.assign"
    },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
        "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
    },
    "#microsoft.graph.createCopy": {
        "title": "microsoft.graph.createCopy",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.createCopy"
    },
    "#microsoft.graph.reorder": {
        "title": "microsoft.graph.reorder",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.reorder"
    },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
        "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
    },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
        "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
    },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
        "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('1979764a-065d-4feb-949e-b3e32b58281a')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
    }
}