{
    "_wap_tags": "Endpoint Security",
    "description": "This policy enables BitLocker to fully encrypt fixed OS, data disks and removable disks based on AES 128-bit XTS. Keys will be stored in Azure AD and client-driven key rotation will be enabled.",
    "name": "NMM Force Bitlocker on Fixed and Removable Drives",
    "platforms": "windows10",
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 12,
    "technologies": "mdm",
    "templateReference": {
        "templateDisplayName": "BitLocker",
        "templateDisplayVersion": "Version 1",
        "templateFamily": "endpointSecurityDiskEncryption",
        "templateId": "46ddfc50-d10f-4867-b852-9434254b3bff_1"
    },
    "settings": [
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "0",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_0",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "1",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_2",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "48278072-3b30-48e9-b654-ad683fdb9aae",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "48c938a7-afa0-40ef-914f-40b5da5735b4"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "2",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "3",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "4",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "e09c3a13-cf03-406c-8e8b-28a2f22939d1",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "b11b114c-0971-42bc-9eec-ebdd73cef0cb"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "5",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "6",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "7",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_0",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "8",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "ddfd6c77-f32f-480c-a43d-4970185ccf15",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7a47b4f2-0d06-46ea-a88a-9809830be5c8"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "9",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [
                                    {
                                        "choiceSettingValue": {
                                            "children": [
                                                {
                                                    "choiceSettingValue": {
                                                        "children": [],
                                                        "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_0",
                                                        "settingValueTemplateReference": null,
                                                        "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                                                    },
                                                    "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                                                    "auditRuleInformation": null,
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                                                }
                                            ],
                                            "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                                            "settingValueTemplateReference": {
                                                "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                                                "useTemplateDefault": false
                                            },
                                            "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                                        },
                                        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                                        "auditRuleInformation": null,
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                                    }
                                ],
                                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "5f8b6127-bc7f-469b-b903-ea3d46035448"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "10",
            "@odata.type": null
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0",
                                "settingValueTemplateReference": null,
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "06f0b5be-421d-4de1-92d1-b9c9b461fa38",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "28e5153b-24cb-45fd-b53d-96847b00c9a6"
                },
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "settingDefinitions": null,
            "settingDefinitions@odata.nextLink": null,
            "id": "11",
            "@odata.type": null
        }
    ],
    "id": "37b6763c-dfcf-4b56-9776-e1e0dd7b5f41",
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(settings())/$entity",
    "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('37b6763c-dfcf-4b56-9776-e1e0dd7b5f41')/settings"
}